Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/svd/PIC32CM5164JH01032.svd
            <register>
               <name>ASYNCH</name>
               <description>External Interrupt Asynchronous Mode</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASYNCH0</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH0Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH1</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH1Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH2</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH2Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH3</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH3Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH4</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH4Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH5</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH5Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH6</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH6Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH7</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH7Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH8</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH8Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH9</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH9Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH10</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH10Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH11</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH11Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH12</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH12Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH13</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH13Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH14</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH14Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASYNCH15</name>
                     <description>Asynchronous Edge Detection Mode of EXTINT15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCH15Select</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
